rails-reddit/app/views/posts/_comment.html.erb


  <% if @post.comments.present?%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]