rails-reddit/app/views/posts/index.html.erb

        <div class="card-body">
          <%= pluralize(post.votes.count, "vote") %> | <%= pluralize(post.downvotes.count, "downvote") %>
---
SELECT COUNT(*) FROM "downvotes" WHERE "downvotes"."post_id" = $1  [["post_id", 2]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 2]]