rails-reddit/app/views/posts/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 2]]
---
    <%= form.hidden_field :user_id, value: current_user.id %>
    <%= pluralize(@post.votes.count, "vote") %>

SELECT COUNT(*) FROM "downvotes" WHERE "downvotes"."post_id" = $1  [["post_id", 2]]
---
<div>
  <%= pluralize(@post.downvotes.count, "downvote") %>