rails-reddit/app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
    if @comment.save!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "post_id", "commenter") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "A new comment"], ["created_at", "2018-05-27 23:57:46.949966"], ["updated_at", "2018-05-27 23:57:46.949966"], ["user_id", 1], ["post_id", 2], ["commenter", "ppreyer123"]]