rails-reddit/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{ |post| post.votes.size }.reverse
---
SELECT "posts".* FROM "posts"
SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 2]]

  def create
    if current_user
      @post = Post.new(post_params)
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "A fantastic post"], ["content", "great stuff"], ["created_at", "2018-05-28 17:32:34.944747"], ["updated_at", "2018-05-28 17:32:34.944747"], ["user_id", 1]]

  def update
    @post = Post.find(params[:id])
    if user_allowed_post
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "Butts"], ["updated_at", "2018-05-25 19:31:24.726679"], ["id", 1]]

  def destroy
    @post = Post.find(params[:id])
    if user_allowed_post
      @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]

  def upvote
    @post = Post.find(params[:id])
    @post.votes.create!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "votes" ("post_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["post_id", 2], ["created_at", "2018-05-28 17:19:38.320053"], ["updated_at", "2018-05-28 17:19:38.320053"]]

  def downvote
    @post = Post.find(params[:id])
    @post.downvotes.create
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "downvotes" ("created_at", "updated_at", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-05-27 23:14:02.839998"], ["updated_at", "2018-05-27 23:14:02.839998"], ["post_id", 2]]