rails-reddit/app/controllers/users_controller.rb

  def show
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "pjp"], ["password_digest", "$2a$10$IbEbKQb22eWdJYuhARdG2..58eVGEmp2hy2/49AiuAugL58s/IYbO"], ["created_at", "2018-05-27 22:44:56.322392"], ["updated_at", "2018-05-27 22:44:56.322392"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$K/4XtT90bQca1YX4v1S/M.kw0j97kqnmWiB0oy1pvo/zNqsHJmi0C"], ["updated_at", "2018-05-27 17:11:24.034175"], ["id", 1]]