rails-reddit/app/views/users/show.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = $1  [["user_id", 1]]
---
        <div class="card-body">
          <%= pluralize(post.votes.count, "vote") %> | <%= pluralize(post.downvotes.count, "downvote") %>